cask_args appdir: "/Applications"

# Taps
tap "homebrew/bundle"
tap "derailed/k9s"
tap "warrensbox/tap"

# Binaries
brew "awscli"
brew "coreutils"
brew "derailed/k9s/k9s"
brew "git"
brew "git-lfs"
brew "gnupg"
brew "jq"
brew "mackup"
brew "nvm" # to install npm and node later on
brew "python"
brew "tmux"
brew "terragrunt"
brew "warrensbox/tap/tfswitch"
brew "zsh"

# Apps
cask "docker"
cask "iterm2"
cask "scroll-reverser"
cask "visual-studio-code"